# Concatenacion de dataframes
concatenar = juntar, unir o fusionar

para dataf existen 3 formas de concatenar 
* concat (concatenar)
* merge (fusionar)
* join (unir)

## concat

esta tecnica basicamente se centra en bases de datos comunes, que tienen las mismas columnas y por tanto hay que juntar las filas

In [1]:
import pandas as pd

In [3]:
df1 = pd.DataFrame ({'A':['1A','2A'], 'B':['1B','2B'], 'C':['1C','2C']})
df2 = pd.DataFrame ({'A':['6A','7A','8A'], 'B':['6B','7B','8B'], 'C':['6C','7C','8C']})

## Es un diccionario por las llaves, pero por los parentesis se esta convirtiendo a un df

In [4]:
df1

    A   B   C
0  1A  1B  1C
1  2A  2B  2C

In [5]:
df2

    A   B   C
0  6A  6B  6C
1  7A  7B  7C
2  8A  8B  8C

In [6]:
pd.concat([df1,df2])

### aqui podria arreglarse lo del 0,1,0,1

    A   B   C
0  1A  1B  1C
1  2A  2B  2C
0  6A  6B  6C
1  7A  7B  7C
2  8A  8B  8C

In [9]:
pd.concat([df1,df2], ignore_index=True)
## para solucionar el problema de arriba

    A   B   C
0  1A  1B  1C
1  2A  2B  2C
2  6A  6B  6C
3  7A  7B  7C
4  8A  8B  8C

In [10]:
## si nuestro df tiene mas valores en uno de los df, al concatenar los vacios quedan con NaN

df1 = pd.DataFrame ({'A':['1A','2A'], 'B':['1B','2B'], 'C':['1C','2C'], 'K':['1K','2K']})
df2 = pd.DataFrame ({'A':['6A','7A','8A'], 'B':['6B','7B','8B'], 'C':['6C','7C','8C']})

In [11]:
pd.concat([df1,df2])

    A   B   C    K
0  1A  1B  1C   1K
1  2A  2B  2C   2K
0  6A  6B  6C  NaN
1  7A  7B  7C  NaN
2  8A  8B  8C  NaN

## Merge

Esta tecnica fusiona diferentes df a partir de una columna (clave) en comun

In [27]:
df1 = pd.DataFrame ({'A':['1A','2A','3A'], 'B':['1B','2B','3B']})
df2 = pd.DataFrame ({'A':['1A','2A'], 'C':['1C','2C'], 'K':['1K','2K']})

In [15]:
df1

    A   B
0  1A  1B
1  2A  2B

In [16]:
df2

    A   C   K
0  1A  1C  1K
1  2A  2C  2K

In [18]:
pd.merge(df1,df2, on=['A'])
 
## aqui se fusiona de dos en dos, asi que tenemos que especificar que columna tomamos como pibote

    A   B   C   K
0  1A  1B  1C  1K
1  2A  2B  2C  2K

In [21]:
pd.merge(df1,df2, on=['k'])

## si es fusion a la K sale error porque el primer df no tiene la columna k

    A   B   C   K
0  1A  1B  1C  1K
1  2A  2B  2C  2K

In [28]:
pd.merge(df1,df2, on=['A'], how='outer')

## outer es todo

    A   B    C    K
0  1A  1B   1C   1K
1  2A  2B   2C   2K
2  3A  3B  NaN  NaN

In [29]:
pd.merge(df1,df2, on=['A'], how='left')

## inner es solo lo de en medio

    A   B    C    K
0  1A  1B   1C   1K
1  2A  2B   2C   2K
2  3A  3B  NaN  NaN

## Join
La idea de este dataframe es combinar las columnas de dos df indexados

In [32]:
df1 = pd.DataFrame ({'Z':['1A','2A','3A'], 'B':['1B','2B','3B']}, index=['i1','i2','i3'])
df2 = pd.DataFrame ({'A':['5A','6A'], 'C':['1C','2C'], 'K':['1K','2K']},  index=['i1','i2'])

In [34]:
df1.join(df2)

## los une a partir de los valores de los indices

     Z   B    A    C    K
i1  1A  1B   5A   1C   1K
i2  2A  2B   6A   2C   2K
i3  3A  3B  NaN  NaN  NaN

# entradas y salidas

In [ ]:
## fichero es  un archivo que contiene una data: html, pdf, etc. 
# ej. si un pdf lo abres en bloc de notas aparece un codigo, que se llama codificaciones
## una codificacion plana, la podemos abrir en cualquier lado como el bloc de notas

In [37]:
df3 = df1.join(df2)
df3

     Z   B    A    C    K
i1  1A  1B   5A   1C   1K
i2  2A  2B   6A   2C   2K
i3  3A  3B  NaN  NaN  NaN

In [48]:
df3.to_csv('nombre.csv', index=False)

## crea un archivo excel directamente en el folder

In [50]:
pd.read_csv(r"C:\Users\HP\Documents\GitHub\Neurociencias-2026-1\S02_clases\nombre.csv")

    Z   B    A    C    K
0  1A  1B   5A   1C   1K
1  2A  2B   6A   2C   2K
2  3A  3B  NaN  NaN  NaN